dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDmu_bf.h
/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINHSMCFG */
#define IFX_DMU_HF_CONFIRM0_PROINHSMCFG_OFF (14u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD0C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD0C_OFF (16u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD1C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD1C_OFF (18u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD2C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD2C_OFF (20u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINBMHD3C */
#define IFX_DMU_HF_CONFIRM0_PROINBMHD3C_OFF (22u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINREDSEC */
#define IFX_DMU_HF_CONFIRM0_PROINREDSEC_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINREDSEC */
#define IFX_DMU_HF_CONFIRM0_PROINREDSEC_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINREDSEC */
#define IFX_DMU_HF_CONFIRM0_PROINREDSEC_OFF (24u)

/** \brief Length for Ifx_DMU_HF_CONFIRM0_Bits.PROINSRT */
#define IFX_DMU_HF_CONFIRM0_PROINSRT_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM0_Bits.PROINSRT */
#define IFX_DMU_HF_CONFIRM0_PROINSRT_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM0_Bits.PROINSRT */
#define IFX_DMU_HF_CONFIRM0_PROINSRT_OFF (30u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINPO */
#define IFX_DMU_HF_CONFIRM1_PROINPO_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINPO */
#define IFX_DMU_HF_CONFIRM1_PROINPO_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINPO */
#define IFX_DMU_HF_CONFIRM1_PROINPO_OFF (0u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINDO */
#define IFX_DMU_HF_CONFIRM1_PROINDO_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINDO */
#define IFX_DMU_HF_CONFIRM1_PROINDO_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINDO */
#define IFX_DMU_HF_CONFIRM1_PROINDO_OFF (2u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGO */
#define IFX_DMU_HF_CONFIRM1_PROINDBGO_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGO */
#define IFX_DMU_HF_CONFIRM1_PROINDBGO_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGO */
#define IFX_DMU_HF_CONFIRM1_PROINDBGO_OFF (4u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMO */
#define IFX_DMU_HF_CONFIRM1_PROINHSMO_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMO */
#define IFX_DMU_HF_CONFIRM1_PROINHSMO_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMO */
#define IFX_DMU_HF_CONFIRM1_PROINHSMO_OFF (6u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0O_OFF (8u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1O_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1O_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1O */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1O_OFF (10u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINECO */
#define IFX_DMU_HF_CONFIRM1_PROINECO_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINECO */
#define IFX_DMU_HF_CONFIRM1_PROINECO_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINECO */
#define IFX_DMU_HF_CONFIRM1_PROINECO_OFF (12u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINPC */
#define IFX_DMU_HF_CONFIRM1_PROINPC_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINPC */
#define IFX_DMU_HF_CONFIRM1_PROINPC_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINPC */
#define IFX_DMU_HF_CONFIRM1_PROINPC_OFF (16u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINDC */
#define IFX_DMU_HF_CONFIRM1_PROINDC_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINDC */
#define IFX_DMU_HF_CONFIRM1_PROINDC_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINDC */
#define IFX_DMU_HF_CONFIRM1_PROINDC_OFF (18u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGC */
#define IFX_DMU_HF_CONFIRM1_PROINDBGC_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGC */
#define IFX_DMU_HF_CONFIRM1_PROINDBGC_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINDBGC */
#define IFX_DMU_HF_CONFIRM1_PROINDBGC_OFF (20u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMC */
#define IFX_DMU_HF_CONFIRM1_PROINHSMC_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMC */
#define IFX_DMU_HF_CONFIRM1_PROINHSMC_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMC */
#define IFX_DMU_HF_CONFIRM1_PROINHSMC_OFF (22u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP0C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP0C_OFF (24u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1C_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1C_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINHSMCOTP1C */
#define IFX_DMU_HF_CONFIRM1_PROINHSMCOTP1C_OFF (26u)

/** \brief Length for Ifx_DMU_HF_CONFIRM1_Bits.PROINECC */
#define IFX_DMU_HF_CONFIRM1_PROINECC_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_CONFIRM1_Bits.PROINECC */
#define IFX_DMU_HF_CONFIRM1_PROINECC_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_CONFIRM1_Bits.PROINECC */
#define IFX_DMU_HF_CONFIRM1_PROINECC_OFF (28u)

