dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HF_PWAIT_Bits.CECC */
#define IFX_DMU_HF_PWAIT_CECC_MSK (0x7u)

/** \brief Offset for Ifx_DMU_HF_PWAIT_Bits.CECC */
#define IFX_DMU_HF_PWAIT_CECC_OFF (24u)

/** \brief Length for Ifx_DMU_HF_DWAIT_Bits.RFLASH */
#define IFX_DMU_HF_DWAIT_RFLASH_LEN (8u)

/** \brief Mask for Ifx_DMU_HF_DWAIT_Bits.RFLASH */
#define IFX_DMU_HF_DWAIT_RFLASH_MSK (0xffu)

/** \brief Offset for Ifx_DMU_HF_DWAIT_Bits.RFLASH */
#define IFX_DMU_HF_DWAIT_RFLASH_OFF (0u)

/** \brief Length for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_LEN (3u)

/** \brief Mask for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_MSK (0x7u)

/** \brief Offset for Ifx_DMU_HF_DWAIT_Bits.RECC */
#define IFX_DMU_HF_DWAIT_RECC_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONUSR_Bits.MODE */
#define IFX_DMU_HF_PROCONUSR_MODE_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONPF_Bits.RPRO */
#define IFX_DMU_HF_PROCONPF_RPRO_OFF (31u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.TP */
#define IFX_DMU_HF_PROCONTP_TP_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.BML */
#define IFX_DMU_HF_PROCONTP_BML_OFF (8u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.SWAPEN */
#define IFX_DMU_HF_PROCONTP_SWAPEN_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.SWAPEN */
#define IFX_DMU_HF_PROCONTP_SWAPEN_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.SWAPEN */
#define IFX_DMU_HF_PROCONTP_SWAPEN_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.CPU0DDIS */
#define IFX_DMU_HF_PROCONTP_CPU0DDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.CPU0DDIS */
#define IFX_DMU_HF_PROCONTP_CPU0DDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.CPU0DDIS */
#define IFX_DMU_HF_PROCONTP_CPU0DDIS_OFF (18u)

/** \brief Length for Ifx_DMU_HF_PROCONTP_Bits.CPU1DDIS */
#define IFX_DMU_HF_PROCONTP_CPU1DDIS_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONTP_Bits.CPU1DDIS */
#define IFX_DMU_HF_PROCONTP_CPU1DDIS_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONTP_Bits.CPU1DDIS */
#define IFX_DMU_HF_PROCONTP_CPU1DDIS_OFF (19u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.L */
#define IFX_DMU_HF_PROCONDF_L_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.L */
#define IFX_DMU_HF_PROCONDF_L_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.L */
#define IFX_DMU_HF_PROCONDF_L_OFF (0u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.HYSEN */
#define IFX_DMU_HF_PROCONDF_HYSEN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.HYSEN */
#define IFX_DMU_HF_PROCONDF_HYSEN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.HYSEN */
#define IFX_DMU_HF_PROCONDF_HYSEN_OFF (3u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.HYSCTL */
#define IFX_DMU_HF_PROCONDF_HYSCTL_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.HYSCTL */
#define IFX_DMU_HF_PROCONDF_HYSCTL_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.HYSCTL */
#define IFX_DMU_HF_PROCONDF_HYSCTL_OFF (4u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.AMPCTL */
#define IFX_DMU_HF_PROCONDF_AMPCTL_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.AMPCTL */
#define IFX_DMU_HF_PROCONDF_AMPCTL_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.AMPCTL */
#define IFX_DMU_HF_PROCONDF_AMPCTL_OFF (6u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.OSCCFG */
#define IFX_DMU_HF_PROCONDF_OSCCFG_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.OSCCFG */
#define IFX_DMU_HF_PROCONDF_OSCCFG_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.OSCCFG */
#define IFX_DMU_HF_PROCONDF_OSCCFG_OFF (8u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.MODE */
#define IFX_DMU_HF_PROCONDF_MODE_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.MODE */
#define IFX_DMU_HF_PROCONDF_MODE_MSK (0x3u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.MODE */
#define IFX_DMU_HF_PROCONDF_MODE_OFF (9u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.APREN */
#define IFX_DMU_HF_PROCONDF_APREN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.APREN */
#define IFX_DMU_HF_PROCONDF_APREN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.APREN */
#define IFX_DMU_HF_PROCONDF_APREN_OFF (11u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.CAP0EN */
#define IFX_DMU_HF_PROCONDF_CAP0EN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP0EN */
#define IFX_DMU_HF_PROCONDF_CAP0EN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP0EN */
#define IFX_DMU_HF_PROCONDF_CAP0EN_OFF (12u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.CAP1EN */
#define IFX_DMU_HF_PROCONDF_CAP1EN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP1EN */
#define IFX_DMU_HF_PROCONDF_CAP1EN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP1EN */
#define IFX_DMU_HF_PROCONDF_CAP1EN_OFF (13u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP2EN */
#define IFX_DMU_HF_PROCONDF_CAP2EN_OFF (14u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.CAP3EN */
#define IFX_DMU_HF_PROCONDF_CAP3EN_OFF (15u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_LEN (12u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_MSK (0xfffu)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.ESR0CNT */
#define IFX_DMU_HF_PROCONDF_ESR0CNT_OFF (16u)

/** \brief Length for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_LEN (1u)

/** \brief Mask for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HF_PROCONDF_Bits.RPRO */
#define IFX_DMU_HF_PROCONDF_RPRO_OFF (31u)

/** \brief Length for Ifx_DMU_HF_PROCONRAM_Bits.RAMIN */
#define IFX_DMU_HF_PROCONRAM_RAMIN_LEN (2u)

/** \brief Mask for Ifx_DMU_HF_PROCONRAM_Bits.RAMIN */
#define IFX_DMU_HF_PROCONRAM_RAMIN_MSK (0x3u)

