dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDmu_bf.h
/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S62ROM */
#define IFX_DMU_HP_PROCON_OTP1_S62ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S62ROM */
#define IFX_DMU_HP_PROCON_OTP1_S62ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S62ROM */
#define IFX_DMU_HP_PROCON_OTP1_S62ROM_OFF (30u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP1_Bits.S63ROM */
#define IFX_DMU_HP_PROCON_OTP1_S63ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP1_Bits.S63ROM */
#define IFX_DMU_HP_PROCON_OTP1_S63ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP1_Bits.S63ROM */
#define IFX_DMU_HP_PROCON_OTP1_S63ROM_OFF (31u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S64ROM */
#define IFX_DMU_HP_PROCON_OTP2_S64ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S64ROM */
#define IFX_DMU_HP_PROCON_OTP2_S64ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S64ROM */
#define IFX_DMU_HP_PROCON_OTP2_S64ROM_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S65ROM */
#define IFX_DMU_HP_PROCON_OTP2_S65ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S65ROM */
#define IFX_DMU_HP_PROCON_OTP2_S65ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S65ROM */
#define IFX_DMU_HP_PROCON_OTP2_S65ROM_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S66ROM */
#define IFX_DMU_HP_PROCON_OTP2_S66ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S66ROM */
#define IFX_DMU_HP_PROCON_OTP2_S66ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S66ROM */
#define IFX_DMU_HP_PROCON_OTP2_S66ROM_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S67ROM */
#define IFX_DMU_HP_PROCON_OTP2_S67ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S67ROM */
#define IFX_DMU_HP_PROCON_OTP2_S67ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S67ROM */
#define IFX_DMU_HP_PROCON_OTP2_S67ROM_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S68ROM */
#define IFX_DMU_HP_PROCON_OTP2_S68ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S68ROM */
#define IFX_DMU_HP_PROCON_OTP2_S68ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S68ROM */
#define IFX_DMU_HP_PROCON_OTP2_S68ROM_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S69ROM */
#define IFX_DMU_HP_PROCON_OTP2_S69ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S69ROM */
#define IFX_DMU_HP_PROCON_OTP2_S69ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S69ROM */
#define IFX_DMU_HP_PROCON_OTP2_S69ROM_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S70ROM */
#define IFX_DMU_HP_PROCON_OTP2_S70ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S70ROM */
#define IFX_DMU_HP_PROCON_OTP2_S70ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S70ROM */
#define IFX_DMU_HP_PROCON_OTP2_S70ROM_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S71ROM */
#define IFX_DMU_HP_PROCON_OTP2_S71ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S71ROM */
#define IFX_DMU_HP_PROCON_OTP2_S71ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S71ROM */
#define IFX_DMU_HP_PROCON_OTP2_S71ROM_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S72ROM */
#define IFX_DMU_HP_PROCON_OTP2_S72ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S72ROM */
#define IFX_DMU_HP_PROCON_OTP2_S72ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S72ROM */
#define IFX_DMU_HP_PROCON_OTP2_S72ROM_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S73ROM */
#define IFX_DMU_HP_PROCON_OTP2_S73ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S73ROM */
#define IFX_DMU_HP_PROCON_OTP2_S73ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S73ROM */
#define IFX_DMU_HP_PROCON_OTP2_S73ROM_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S74ROM */
#define IFX_DMU_HP_PROCON_OTP2_S74ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S74ROM */
#define IFX_DMU_HP_PROCON_OTP2_S74ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S74ROM */
#define IFX_DMU_HP_PROCON_OTP2_S74ROM_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S75ROM */
#define IFX_DMU_HP_PROCON_OTP2_S75ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S75ROM */
#define IFX_DMU_HP_PROCON_OTP2_S75ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S75ROM */
#define IFX_DMU_HP_PROCON_OTP2_S75ROM_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S76ROM */
#define IFX_DMU_HP_PROCON_OTP2_S76ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S76ROM */
#define IFX_DMU_HP_PROCON_OTP2_S76ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S76ROM */
#define IFX_DMU_HP_PROCON_OTP2_S76ROM_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S77ROM */
#define IFX_DMU_HP_PROCON_OTP2_S77ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S77ROM */
#define IFX_DMU_HP_PROCON_OTP2_S77ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S77ROM */
#define IFX_DMU_HP_PROCON_OTP2_S77ROM_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S78ROM */
#define IFX_DMU_HP_PROCON_OTP2_S78ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S78ROM */
#define IFX_DMU_HP_PROCON_OTP2_S78ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S78ROM */
#define IFX_DMU_HP_PROCON_OTP2_S78ROM_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S79ROM */
#define IFX_DMU_HP_PROCON_OTP2_S79ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S79ROM */
#define IFX_DMU_HP_PROCON_OTP2_S79ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP2_Bits.S79ROM */
#define IFX_DMU_HP_PROCON_OTP2_S79ROM_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP2_Bits.S80ROM */
#define IFX_DMU_HP_PROCON_OTP2_S80ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP2_Bits.S80ROM */
#define IFX_DMU_HP_PROCON_OTP2_S80ROM_MSK (0x1u)

