dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S99ROM */
#define IFX_DMU_HP_PROCON_OTP3_S99ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S99ROM */
#define IFX_DMU_HP_PROCON_OTP3_S99ROM_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S100ROM */
#define IFX_DMU_HP_PROCON_OTP3_S100ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S100ROM */
#define IFX_DMU_HP_PROCON_OTP3_S100ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S100ROM */
#define IFX_DMU_HP_PROCON_OTP3_S100ROM_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S101ROM */
#define IFX_DMU_HP_PROCON_OTP3_S101ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S101ROM */
#define IFX_DMU_HP_PROCON_OTP3_S101ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S101ROM */
#define IFX_DMU_HP_PROCON_OTP3_S101ROM_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S102ROM */
#define IFX_DMU_HP_PROCON_OTP3_S102ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S102ROM */
#define IFX_DMU_HP_PROCON_OTP3_S102ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S102ROM */
#define IFX_DMU_HP_PROCON_OTP3_S102ROM_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S103ROM */
#define IFX_DMU_HP_PROCON_OTP3_S103ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S103ROM */
#define IFX_DMU_HP_PROCON_OTP3_S103ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S103ROM */
#define IFX_DMU_HP_PROCON_OTP3_S103ROM_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S104ROM */
#define IFX_DMU_HP_PROCON_OTP3_S104ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S104ROM */
#define IFX_DMU_HP_PROCON_OTP3_S104ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S104ROM */
#define IFX_DMU_HP_PROCON_OTP3_S104ROM_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S105ROM */
#define IFX_DMU_HP_PROCON_OTP3_S105ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S105ROM */
#define IFX_DMU_HP_PROCON_OTP3_S105ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S105ROM */
#define IFX_DMU_HP_PROCON_OTP3_S105ROM_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S106ROM */
#define IFX_DMU_HP_PROCON_OTP3_S106ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S106ROM */
#define IFX_DMU_HP_PROCON_OTP3_S106ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S106ROM */
#define IFX_DMU_HP_PROCON_OTP3_S106ROM_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S107ROM */
#define IFX_DMU_HP_PROCON_OTP3_S107ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S107ROM */
#define IFX_DMU_HP_PROCON_OTP3_S107ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S107ROM */
#define IFX_DMU_HP_PROCON_OTP3_S107ROM_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S108ROM */
#define IFX_DMU_HP_PROCON_OTP3_S108ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S108ROM */
#define IFX_DMU_HP_PROCON_OTP3_S108ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S108ROM */
#define IFX_DMU_HP_PROCON_OTP3_S108ROM_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S109ROM */
#define IFX_DMU_HP_PROCON_OTP3_S109ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S109ROM */
#define IFX_DMU_HP_PROCON_OTP3_S109ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S109ROM */
#define IFX_DMU_HP_PROCON_OTP3_S109ROM_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S110ROM */
#define IFX_DMU_HP_PROCON_OTP3_S110ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S110ROM */
#define IFX_DMU_HP_PROCON_OTP3_S110ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S110ROM */
#define IFX_DMU_HP_PROCON_OTP3_S110ROM_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S111ROM */
#define IFX_DMU_HP_PROCON_OTP3_S111ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S111ROM */
#define IFX_DMU_HP_PROCON_OTP3_S111ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S111ROM */
#define IFX_DMU_HP_PROCON_OTP3_S111ROM_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S112ROM */
#define IFX_DMU_HP_PROCON_OTP3_S112ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S112ROM */
#define IFX_DMU_HP_PROCON_OTP3_S112ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S112ROM */
#define IFX_DMU_HP_PROCON_OTP3_S112ROM_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S113ROM */
#define IFX_DMU_HP_PROCON_OTP3_S113ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S113ROM */
#define IFX_DMU_HP_PROCON_OTP3_S113ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S113ROM */
#define IFX_DMU_HP_PROCON_OTP3_S113ROM_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S114ROM */
#define IFX_DMU_HP_PROCON_OTP3_S114ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S114ROM */
#define IFX_DMU_HP_PROCON_OTP3_S114ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S114ROM */
#define IFX_DMU_HP_PROCON_OTP3_S114ROM_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S115ROM */
#define IFX_DMU_HP_PROCON_OTP3_S115ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S115ROM */
#define IFX_DMU_HP_PROCON_OTP3_S115ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S115ROM */
#define IFX_DMU_HP_PROCON_OTP3_S115ROM_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S116ROM */
#define IFX_DMU_HP_PROCON_OTP3_S116ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S116ROM */
#define IFX_DMU_HP_PROCON_OTP3_S116ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S116ROM */
#define IFX_DMU_HP_PROCON_OTP3_S116ROM_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S117ROM */
#define IFX_DMU_HP_PROCON_OTP3_S117ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S117ROM */
#define IFX_DMU_HP_PROCON_OTP3_S117ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S117ROM */
#define IFX_DMU_HP_PROCON_OTP3_S117ROM_OFF (21u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S118ROM */
#define IFX_DMU_HP_PROCON_OTP3_S118ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S118ROM */
#define IFX_DMU_HP_PROCON_OTP3_S118ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S118ROM */
#define IFX_DMU_HP_PROCON_OTP3_S118ROM_OFF (22u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S119ROM */
#define IFX_DMU_HP_PROCON_OTP3_S119ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S119ROM */
#define IFX_DMU_HP_PROCON_OTP3_S119ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S119ROM */
#define IFX_DMU_HP_PROCON_OTP3_S119ROM_OFF (23u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S120ROM */
#define IFX_DMU_HP_PROCON_OTP3_S120ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S120ROM */
#define IFX_DMU_HP_PROCON_OTP3_S120ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S120ROM */
#define IFX_DMU_HP_PROCON_OTP3_S120ROM_OFF (24u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP3_Bits.S121ROM */
#define IFX_DMU_HP_PROCON_OTP3_S121ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP3_Bits.S121ROM */
#define IFX_DMU_HP_PROCON_OTP3_S121ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP3_Bits.S121ROM */
#define IFX_DMU_HP_PROCON_OTP3_S121ROM_OFF (25u)

