dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxDmu_bf.h
/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S160ROM */
#define IFX_DMU_HP_PROCON_OTP5_S160ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S160ROM */
#define IFX_DMU_HP_PROCON_OTP5_S160ROM_OFF (0u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S161ROM */
#define IFX_DMU_HP_PROCON_OTP5_S161ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S161ROM */
#define IFX_DMU_HP_PROCON_OTP5_S161ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S161ROM */
#define IFX_DMU_HP_PROCON_OTP5_S161ROM_OFF (1u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S162ROM */
#define IFX_DMU_HP_PROCON_OTP5_S162ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S162ROM */
#define IFX_DMU_HP_PROCON_OTP5_S162ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S162ROM */
#define IFX_DMU_HP_PROCON_OTP5_S162ROM_OFF (2u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S163ROM */
#define IFX_DMU_HP_PROCON_OTP5_S163ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S163ROM */
#define IFX_DMU_HP_PROCON_OTP5_S163ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S163ROM */
#define IFX_DMU_HP_PROCON_OTP5_S163ROM_OFF (3u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S164ROM */
#define IFX_DMU_HP_PROCON_OTP5_S164ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S164ROM */
#define IFX_DMU_HP_PROCON_OTP5_S164ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S164ROM */
#define IFX_DMU_HP_PROCON_OTP5_S164ROM_OFF (4u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S165ROM */
#define IFX_DMU_HP_PROCON_OTP5_S165ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S165ROM */
#define IFX_DMU_HP_PROCON_OTP5_S165ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S165ROM */
#define IFX_DMU_HP_PROCON_OTP5_S165ROM_OFF (5u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S166ROM */
#define IFX_DMU_HP_PROCON_OTP5_S166ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S166ROM */
#define IFX_DMU_HP_PROCON_OTP5_S166ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S166ROM */
#define IFX_DMU_HP_PROCON_OTP5_S166ROM_OFF (6u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S167ROM */
#define IFX_DMU_HP_PROCON_OTP5_S167ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S167ROM */
#define IFX_DMU_HP_PROCON_OTP5_S167ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S167ROM */
#define IFX_DMU_HP_PROCON_OTP5_S167ROM_OFF (7u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S168ROM */
#define IFX_DMU_HP_PROCON_OTP5_S168ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S168ROM */
#define IFX_DMU_HP_PROCON_OTP5_S168ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S168ROM */
#define IFX_DMU_HP_PROCON_OTP5_S168ROM_OFF (8u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S169ROM */
#define IFX_DMU_HP_PROCON_OTP5_S169ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S169ROM */
#define IFX_DMU_HP_PROCON_OTP5_S169ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S169ROM */
#define IFX_DMU_HP_PROCON_OTP5_S169ROM_OFF (9u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S170ROM */
#define IFX_DMU_HP_PROCON_OTP5_S170ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S170ROM */
#define IFX_DMU_HP_PROCON_OTP5_S170ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S170ROM */
#define IFX_DMU_HP_PROCON_OTP5_S170ROM_OFF (10u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S171ROM */
#define IFX_DMU_HP_PROCON_OTP5_S171ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S171ROM */
#define IFX_DMU_HP_PROCON_OTP5_S171ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S171ROM */
#define IFX_DMU_HP_PROCON_OTP5_S171ROM_OFF (11u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S172ROM */
#define IFX_DMU_HP_PROCON_OTP5_S172ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S172ROM */
#define IFX_DMU_HP_PROCON_OTP5_S172ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S172ROM */
#define IFX_DMU_HP_PROCON_OTP5_S172ROM_OFF (12u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S173ROM */
#define IFX_DMU_HP_PROCON_OTP5_S173ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S173ROM */
#define IFX_DMU_HP_PROCON_OTP5_S173ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S173ROM */
#define IFX_DMU_HP_PROCON_OTP5_S173ROM_OFF (13u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S174ROM */
#define IFX_DMU_HP_PROCON_OTP5_S174ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S174ROM */
#define IFX_DMU_HP_PROCON_OTP5_S174ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S174ROM */
#define IFX_DMU_HP_PROCON_OTP5_S174ROM_OFF (14u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S175ROM */
#define IFX_DMU_HP_PROCON_OTP5_S175ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S175ROM */
#define IFX_DMU_HP_PROCON_OTP5_S175ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S175ROM */
#define IFX_DMU_HP_PROCON_OTP5_S175ROM_OFF (15u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S176ROM */
#define IFX_DMU_HP_PROCON_OTP5_S176ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S176ROM */
#define IFX_DMU_HP_PROCON_OTP5_S176ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S176ROM */
#define IFX_DMU_HP_PROCON_OTP5_S176ROM_OFF (16u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S177ROM */
#define IFX_DMU_HP_PROCON_OTP5_S177ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S177ROM */
#define IFX_DMU_HP_PROCON_OTP5_S177ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S177ROM */
#define IFX_DMU_HP_PROCON_OTP5_S177ROM_OFF (17u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S178ROM */
#define IFX_DMU_HP_PROCON_OTP5_S178ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S178ROM */
#define IFX_DMU_HP_PROCON_OTP5_S178ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S178ROM */
#define IFX_DMU_HP_PROCON_OTP5_S178ROM_OFF (18u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S179ROM */
#define IFX_DMU_HP_PROCON_OTP5_S179ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S179ROM */
#define IFX_DMU_HP_PROCON_OTP5_S179ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S179ROM */
#define IFX_DMU_HP_PROCON_OTP5_S179ROM_OFF (19u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S180ROM */
#define IFX_DMU_HP_PROCON_OTP5_S180ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S180ROM */
#define IFX_DMU_HP_PROCON_OTP5_S180ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S180ROM */
#define IFX_DMU_HP_PROCON_OTP5_S180ROM_OFF (20u)

/** \brief Length for Ifx_DMU_HP_PROCON_OTP5_Bits.S181ROM */
#define IFX_DMU_HP_PROCON_OTP5_S181ROM_LEN (1u)

/** \brief Mask for Ifx_DMU_HP_PROCON_OTP5_Bits.S181ROM */
#define IFX_DMU_HP_PROCON_OTP5_S181ROM_MSK (0x1u)

/** \brief Offset for Ifx_DMU_HP_PROCON_OTP5_Bits.S181ROM */
#define IFX_DMU_HP_PROCON_OTP5_S181ROM_OFF (21u)

